---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AllowLargeGeometry.DisAllow
enum: Autodesk.Revit.DB.Analysis.AllowLargeGeometry
source: html/4b5a3532-d4f3-4cc3-ca7f-d75cb3ba719f.htm
---
# Autodesk.Revit.DB.Analysis.AllowLargeGeometry.DisAllow

Cancel the export/path of travel creation, failing with the apporiate status.